app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Best scissors"], ["content", "These are the best scissors ever created!!!"], ["created_at", "2020-03-31 01:04:48.633626"], ["updated_at", "2020-03-31 01:04:48.633626"], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)
      if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Old school shaving cream that my grandpa used!"], ["updated_at", "2020-04-18 00:29:45.384030"], ["id", 20]]
---
  def update
    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 10]]
---
  def destroy
    if @post.destroy