app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Liquidsword"], ["LIMIT", 1]]
---
  def create
      @user = User.find_by(username: params[:session][:username])